## Topic: ordinal Encoding

### OUTCOMES

- 1. Introduction of ordinal encoding.

- 2. Code Implementation of ordinal encoding.

### 1. Introduction of ordinal Encoding.

- Definition:
    - Encoding is use for convert categorical data to numerical data.

- Type of Categorical Data
    - 1. nominal data
        - no order data
        - eg: (color, city, gender)
   
    - 2. ordinal data
        - order data
        - eg: (rank, course feedback, review)


- Ordinal Encoding use for ordinal categorical data.


- steps of ordinal encoding:

    - step_01: detect the ordinal column

    - step_02: decide the order
        - for decide order is very important
        - order always maintain sequence or hierarchy
        - order sequence (small < medium < large)

In [2]:
import numpy as np

import pandas as pd

### 2. Code Implementation of ordinal encoding.

In [3]:
df = pd.DataFrame({
    "id":[1,2,3,4],
    "color":["red","blue","green","red"],
    "size":["Small","Medium","Large","Medium"],
    "price":[10,12,15,11]
})

df

   id  color    size  price
0   1    red   Small     10
1   2   blue  Medium     12
2   3  green   Large     15
3   4    red  Medium     11

- here, our target column => size
- because size contain the ordinal categorical featues

In [ ]:
# To see how many unique values are present
df['size'].unique()

array(['Small', 'Medium', 'Large'], dtype=object)

In [7]:
# Step_01: decide the order for each unique column

order = {
    'Small': 1,
    'Medium': 2,
    'Large' : 3
}

In [8]:
# Step_03: apply ordinal encoding or convert wholes featues

# way_1: convert and add new column

df['size_encode'] = df['size'].map(order).astype(int)

df

   id  color    size  price  size_encode
0   1    red   Small     10            1
1   2   blue  Medium     12            2
2   3  green   Large     15            3
3   4    red  Medium     11            2

In [9]:
# romove the old column

df.drop('size', axis = 1)

   id  color  price  size_encode
0   1    red     10            1
1   2   blue     12            2
2   3  green     15            3
3   4    red     11            2

In [ ]:
# way_02: convert to original column

# df['size'] = df['size'].map(order).astype(int)

### ordinal Encoding for real world dataset

In [10]:
df = pd.read_csv("Data.csv")

df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

- here our target column => Purchased
- because Purchased is a ordinal categorical column

In [11]:
# To see Number of unique categorical 

df['Purchased'].unique()

array(['No', 'Yes'], dtype=object)

- so, here two unique values
    - No
    - Yes

In [12]:
# step_01: decide the order
# No = 0
# Yes = 1

order = {
    'No': 0,
    'Yes': 1
}

In [13]:
# step_02: apply ordinal encoding

df['Purchased'] = df['Purchased'].map(order).astype(int)

df

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

- so, Purchased colums are ready for model learning.